In [1]:
import pandas as pd

In [2]:
FILE_PATH = '/Users/apple/Desktop/Data analysis/names'

In [3]:
def count_top3(list):
    dataframe = {}
    dataframe_list = []
    for item in list:
        dataframe[item] = pd.read_csv(f'{FILE_PATH}/yob{item}.txt', names = ['name', 'gender', 'count'])
        dataframe_list.append(dataframe[item])    
    all_names = pd.concat(dataframe)
    all_names = all_names.groupby(['name']).sum()
    sorted_names = all_names.sort_values(by = ['count'], ascending = False).head(3)
    return sorted_names

count_top3([1880])

         count
name
John      9701
William   9562
Mary      7092

In [4]:
count_top3([1900, 1950, 2000])

         count
name
James   111789
John    109601
Robert  101368

In [5]:
def count_dynamic(list):
    dataframe = {}
    dataframe_list = []
    for item in list:
        dataframe[item] = pd.read_csv(f'{FILE_PATH}/yob{item}.txt', names = ['name', 'gender', 'count'])
    all_tables = pd.concat(dataframe).reset_index(level=1, drop = True)
    grouped_names = all_tables.groupby([all_tables.index,'gender']).sum()
    return grouped_names
count_dynamic([1900, 1950, 2000])

               count
     gender
1900 F        299798
     M        150480
1950 F       1713065
     M       1790437
2000 F       1815295
     M       1963202